---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SteelElementsFailures.SteelElementModifiersWillBeIgnoredWarn
source: html/4d3fd97a-85dc-3288-de78-64dbd7c67224.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SteelElementsFailures.SteelElementModifiersWillBeIgnoredWarn Property

The copes and cuts (by face, with voids, by reference plane) of the element are no longer modifying the geometry.

## Syntax (C#)
```csharp
public static FailureDefinitionId SteelElementModifiersWillBeIgnoredWarn { get; }
```